/** 
 *****************************Copyright (c) 2023  ZJU****************************
 * @file      : depth.cpp
 * @brief     : 深度计设备基类
 * @history   :
 *  Version     Date            Author          Note
 *  V1.0.0    2023-08-14         WPJ        1. <note>
 *  V1.0.1    2023-9-30          Hao Lion   1. 重构为c++类
 *******************************************************************************
 * @verbatim :
 *==============================================================================
 *                                                                             
 *                                                    
 *==============================================================================
 * @endverbatim :
 *****************************Copyright (c) 2023  ZJU****************************
 */


#include "depth/depth.hpp"


/**
 * @brief 深度计基类的构造函数，初始化depth_data
 * @retval none
*/
Depth::Depth(){
    memset(&depth_data,0,sizeof(depth_data));
}






